spec/fixtures/order_cancellations/list.json

{
    "meta": {
        "limit": 50,
        "before": null,
        "after": "g3QAAAACZAACaWRtAAAAGm9yZV8wMDAwQThMNDhZTVlYVGlnVmlLZFpnZAALaW5zZXJ0ZWRfYXR0AAAADWQACl9fc3RydWN0X19kAA9FbGl4aXIuRGF0ZVRpbWVkAAhjYWxlbmRhcmQAE0VsaXhpci5DYWxlbmRhci5JU09kAANkYXlhEGQABGhvdXJhCWQAC21pY3Jvc2Vjb25kaAJiAAP8J2EGZAAGbWludXRlYQ5kAAVtb250aGEGZAAGc2Vjb25kYTVkAApzdGRfb2Zmc2V0YQBkAAl0aW1lX3pvbmVtAAAAB0V0Yy9VVENkAAp1dGNfb2Zmc2V0YQBkAAR5ZWFyYgAAB-VkAAl6b25lX2FiYnJtAAAAA1VUQw=="
    },
    "data": [
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "177.80",
            "order_id": "ord_0000AEMtG5Awt5i1RDfCUa",
            "live_mode": false,
            "id": "ore_0000AEUvjGoJlav2j6FDlZ",
            "expires_at": null,
            "created_at": "2021-12-17T14:40:23.924929Z",
            "confirmed_at": "2021-12-17T14:42:46.367082Z"
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "342.70",
            "order_id": "ord_0000AEUvUZSEGOto6zwvWZ",
            "live_mode": false,
            "id": "ore_0000AEUvZLKc6SjhqscJaG",
            "expires_at": null,
            "created_at": "2021-12-17T14:38:36.280374Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "342.70",
            "order_id": "ord_0000AEUvUZSEGOto6zwvWZ",
            "live_mode": false,
            "id": "ore_0000AEUvVqGt7xooeUCm9J",
            "expires_at": null,
            "created_at": "2021-12-17T14:37:58.316735Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "486.97",
            "order_id": "ord_0000AEUOcESAnl4AXIlCeO",
            "live_mode": false,
            "id": "ore_0000AEUOdMam1lXS4FK3m4",
            "expires_at": "2021-12-17T08:49:33Z",
            "created_at": "2021-12-17T08:29:33.931833Z",
            "confirmed_at": "2021-12-17T08:30:47.847216Z"
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "98.72",
            "order_id": "ord_0000ADgfO0Wu66l7EhqVzz",
            "live_mode": false,
            "id": "ore_0000AEQOHL6fV8D8O7rU5A",
            "expires_at": "2021-12-15T10:36:43Z",
            "created_at": "2021-12-15T10:06:44.400901Z",
            "confirmed_at": "2021-12-15T10:08:14.276227Z"
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "79.52",
            "order_id": "ord_0000ADgewECK0PnTJ9vwOW",
            "live_mode": false,
            "id": "ore_0000AEQO1e661OLfMAUNf7",
            "expires_at": null,
            "created_at": "2021-12-15T10:03:54.224695Z",
            "confirmed_at": "2021-12-15T10:04:09.871507Z"
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "79.52",
            "order_id": "ord_0000ADgewECK0PnTJ9vwOW",
            "live_mode": false,
            "id": "ore_0000AEQNrajmlNajKysfpp",
            "expires_at": null,
            "created_at": "2021-12-15T10:02:05.201680Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "79.52",
            "order_id": "ord_0000ADgewECK0PnTJ9vwOW",
            "live_mode": false,
            "id": "ore_0000AEQNUopruELpX8foiv",
            "expires_at": null,
            "created_at": "2021-12-15T09:57:58.264333Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "7050.87",
            "order_id": "ord_0000AEDvNKCM2lbZIEXBbQ",
            "live_mode": false,
            "id": "ore_0000AEOHUAYPNNxL1zG401",
            "expires_at": "2021-12-14T10:41:12Z",
            "created_at": "2021-12-14T09:41:12.054235Z",
            "confirmed_at": "2021-12-14T09:41:15.532129Z"
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "7050.87",
            "order_id": "ord_0000AEDvNKCM2lbZIEXBbQ",
            "live_mode": false,
            "id": "ore_0000AEOHR6i6ZtW6B6C3eb",
            "expires_at": "2021-12-14T10:40:38Z",
            "created_at": "2021-12-14T09:40:38.850667Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "298.09",
            "order_id": "ord_0000AEEJHAa4xMapExEzNw",
            "live_mode": false,
            "id": "ore_0000AEEJHvUiX7EMjw5s3M",
            "expires_at": "2021-12-09T14:44:16Z",
            "created_at": "2021-12-09T14:14:17.117262Z",
            "confirmed_at": "2021-12-09T14:14:23.284688Z"
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "1890.33",
            "order_id": "ord_0000ADIbaNOUBpN0bNOtpw",
            "live_mode": false,
            "id": "ore_0000AEEDpuGF1gMv2F8tQf",
            "expires_at": "2021-12-09T14:13:11Z",
            "created_at": "2021-12-09T13:13:11.774399Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "278.10",
            "order_id": "ord_0000ADgfXOaE2JEKRXsNyS",
            "live_mode": false,
            "id": "ore_0000ADl5OCsrydV3VQq0VU",
            "expires_at": "2021-11-25T12:11:55Z",
            "created_at": "2021-11-25T11:51:55.318911Z",
            "confirmed_at": "2021-11-25T11:52:44.556800Z"
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "298.92",
            "order_id": "ord_0000ADgfO0Wu66l7EhqVzz",
            "live_mode": false,
            "id": "ore_0000ADie4IhKA3POGQFyxV",
            "expires_at": "2021-11-24T08:06:21Z",
            "created_at": "2021-11-24T07:36:21.974201Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "113.52",
            "order_id": "ord_0000ADgewECK0PnTJ9vwOW",
            "live_mode": false,
            "id": "ore_0000ADidytqqtktr09MMfR",
            "expires_at": null,
            "created_at": "2021-11-24T07:35:23.409867Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "98.67",
            "order_id": "ord_0000ADhFzSPAwo2jBXhmAy",
            "live_mode": false,
            "id": "ore_0000ADhG6GoMhabFwJJZab",
            "expires_at": null,
            "created_at": "2021-11-23T15:33:05.420987Z",
            "confirmed_at": "2021-11-23T15:33:18.944087Z"
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "98.67",
            "order_id": "ord_0000ADhFzSPAwo2jBXhmAy",
            "live_mode": false,
            "id": "ore_0000ADhFztI7Ej6LFuBjyy",
            "expires_at": null,
            "created_at": "2021-11-23T15:31:56.245887Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "0.00",
            "order_id": "ord_0000ABocaaKsxVV1MgcKcC",
            "live_mode": false,
            "id": "ore_0000ADgdNnmWAoql9uAt9d",
            "expires_at": "2021-11-23T08:49:15Z",
            "created_at": "2021-11-23T08:19:15.778280Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "0.00",
            "order_id": "ord_0000ACLcL6OlbIPiF1P04W",
            "live_mode": false,
            "id": "ore_0000ADgdBELXXFgYCkGsW8",
            "expires_at": "2021-11-23T08:46:59Z",
            "created_at": "2021-11-23T08:16:59.457914Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "333.02",
            "order_id": "ord_0000ADWz0QpBtidrnLVQhs",
            "live_mode": false,
            "id": "ore_0000ADWz2n6R4fl2wUxdyL",
            "expires_at": null,
            "created_at": "2021-11-18T16:34:51.786172Z",
            "confirmed_at": "2021-11-18T16:34:54.218909Z"
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "1.48",
            "order_id": "ord_0000ADWyI49Rs1oyCv5dxo",
            "live_mode": false,
            "id": "ore_0000ADWyLAQAArYMpIxeGO",
            "expires_at": null,
            "created_at": "2021-11-18T16:26:58.747352Z",
            "confirmed_at": "2021-11-18T16:27:12.817532Z"
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "213.52",
            "order_id": "ord_0000ADJoBlKuRNc4pIXdya",
            "live_mode": false,
            "id": "ore_0000ADJoShZ2e8RTyIfzSi",
            "expires_at": "2021-11-12T08:35:02Z",
            "created_at": "2021-11-12T08:05:02.614035Z",
            "confirmed_at": "2021-11-12T08:05:38.634318Z"
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "35.62",
            "order_id": "ord_0000ADJlZMSuGKBcmHqM0u",
            "live_mode": false,
            "id": "ore_0000ADJlaRJJjVKI5ws8rx",
            "expires_at": "2021-11-12T08:02:49Z",
            "created_at": "2021-11-12T07:32:49.616451Z",
            "confirmed_at": "2021-11-12T07:32:59.380139Z"
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "1765.33",
            "order_id": "ord_0000ADIbaNOUBpN0bNOtpw",
            "live_mode": false,
            "id": "ore_0000ADIiI7hxecXE1a3l9F",
            "expires_at": "2021-11-11T20:21:11Z",
            "created_at": "2021-11-11T19:21:11.420961Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "1499.33",
            "order_id": "ord_0000ADGJu6ZQBKx9WMszlw",
            "live_mode": false,
            "id": "ore_0000ADGJusKAdLH5cy7UfJ",
            "expires_at": "2021-11-10T16:08:38Z",
            "created_at": "2021-11-10T15:38:38.741686Z",
            "confirmed_at": "2021-11-10T15:38:52.185515Z"
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "0.00",
            "order_id": "ord_0000ADC5s0CEzxwqt5PQau",
            "live_mode": false,
            "id": "ore_0000ADC5sdXuNS5AtEL0NN",
            "expires_at": null,
            "created_at": "2021-11-08T14:42:31.536973Z",
            "confirmed_at": "2021-11-08T14:42:38.167030Z"
        },
        {
            "refund_to": "awaiting_payment",
            "refund_currency": "GBP",
            "refund_amount": "0.00",
            "order_id": "ord_0000AC3F2FPxSwEJdinggK",
            "live_mode": false,
            "id": "ore_0000AC3Gc8BNVZELfXQSwb",
            "expires_at": "2021-10-05T11:38:17Z",
            "created_at": "2021-10-05T10:38:17.685733Z",
            "confirmed_at": "2021-10-05T10:40:44.935640Z"
        },
        {
            "refund_to": "awaiting_payment",
            "refund_currency": "GBP",
            "refund_amount": "0.00",
            "order_id": "ord_0000AC3F2FPxSwEJdinggK",
            "live_mode": false,
            "id": "ore_0000AC3FWRV6feE9tLNSVN",
            "expires_at": "2021-10-05T11:26:03Z",
            "created_at": "2021-10-05T10:26:03.701509Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "150.62",
            "order_id": "ord_0000AC16xR0YM0Wd0JzwKu",
            "live_mode": false,
            "id": "ore_0000AC170oR1i2syWwzX7J",
            "expires_at": "2021-10-04T10:11:16Z",
            "created_at": "2021-10-04T09:41:16.951431Z",
            "confirmed_at": "2021-10-04T09:41:48.878915Z"
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "491.92",
            "order_id": "ord_0000ABozZW4MvwdPodU4nI",
            "live_mode": false,
            "id": "ore_0000ABozbUSJ99lSrxAg0P",
            "expires_at": "2021-09-28T14:21:44Z",
            "created_at": "2021-09-28T13:21:44.115061Z",
            "confirmed_at": "2021-09-28T13:21:51.403329Z"
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "491.92",
            "order_id": "ord_0000ABozZW4MvwdPodU4nI",
            "live_mode": false,
            "id": "ore_0000ABozaP5zab6VxLDPQ9",
            "expires_at": "2021-09-28T14:21:32Z",
            "created_at": "2021-09-28T13:21:32.338350Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "179.02",
            "order_id": "ord_0000ABoWq3xYV91lrNhaRk",
            "live_mode": false,
            "id": "ore_0000ABoX2mluy13cd1soa1",
            "expires_at": "2021-09-28T08:31:42Z",
            "created_at": "2021-09-28T08:01:43.358816Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "22.40",
            "order_id": "ord_0000AAg1roaUD0e75xZdFA",
            "live_mode": false,
            "id": "ore_0000ABYSKU7oTaUTL5kGkS",
            "expires_at": "2021-09-20T14:13:30Z",
            "created_at": "2021-09-20T13:53:30.916755Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "22.40",
            "order_id": "ord_0000AAg1roaUD0e75xZdFA",
            "live_mode": false,
            "id": "ore_0000ABYRxA5sRnbONsOyaP",
            "expires_at": "2021-09-20T14:09:17Z",
            "created_at": "2021-09-20T13:49:18.011000Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "22.40",
            "order_id": "ord_0000AAg1roaUD0e75xZdFA",
            "live_mode": false,
            "id": "ore_0000ABYRuBRxHsUTtFcpCi",
            "expires_at": "2021-09-20T14:08:45Z",
            "created_at": "2021-09-20T13:48:45.717414Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "66.72",
            "order_id": "ord_0000ABYQeSGIuenzRc6yUy",
            "live_mode": false,
            "id": "ore_0000ABYQglRaZ7nfW1UVRS",
            "expires_at": null,
            "created_at": "2021-09-20T13:35:07.901307Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "1453.57",
            "order_id": "ord_0000AAFeNtfBF21KPqJcp6",
            "live_mode": false,
            "id": "ore_0000AAWFTXarzs8e6DDLX6",
            "expires_at": "2021-08-20T15:27:57Z",
            "created_at": "2021-08-20T14:27:57.766237Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "1453.57",
            "order_id": "ord_0000AAFeNtfBF21KPqJcp6",
            "live_mode": false,
            "id": "ore_0000AAWFT6M2aMNiEJ8fmC",
            "expires_at": "2021-08-20T15:27:53Z",
            "created_at": "2021-08-20T14:27:53.002997Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "779.28",
            "order_id": "ord_0000AAFe8EkNI9uGdacDdg",
            "live_mode": false,
            "id": "ore_0000AAUHY4SFPEbju1dWev",
            "expires_at": "2021-08-19T16:41:46Z",
            "created_at": "2021-08-19T15:41:46.134107Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "779.28",
            "order_id": "ord_0000AAFe8EkNI9uGdacDdg",
            "live_mode": false,
            "id": "ore_0000AAUHGcpuD6zw9sKfBJ",
            "expires_at": "2021-08-19T16:38:36Z",
            "created_at": "2021-08-19T15:38:36.964328Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "1453.57",
            "order_id": "ord_0000AAFeNtfBF21KPqJcp6",
            "live_mode": false,
            "id": "ore_0000AASFqvKpLrX46SiPMf",
            "expires_at": "2021-08-18T17:13:20Z",
            "created_at": "2021-08-18T16:13:20.607011Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "477.97",
            "order_id": "ord_0000AAO2XZV9EKXLTLow9A",
            "live_mode": false,
            "id": "ore_0000AAO2Ym6QrxhfYtm6hI",
            "expires_at": null,
            "created_at": "2021-08-16T15:25:33.177608Z",
            "confirmed_at": "2021-08-16T15:25:48.275235Z"
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "6793.30",
            "order_id": "ord_0000AAJHwKLMxlo9GKdhKq",
            "live_mode": false,
            "id": "ore_0000AAJI02d2libjTkg3of",
            "expires_at": "2021-08-14T09:24:59Z",
            "created_at": "2021-08-14T08:24:59.969520Z",
            "confirmed_at": "2021-08-14T08:25:04.495944Z"
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "1453.57",
            "order_id": "ord_0000AAFeNtfBF21KPqJcp6",
            "live_mode": false,
            "id": "ore_0000AAFeoSGdQfBc9Vwhou",
            "expires_at": "2021-08-12T15:21:46Z",
            "created_at": "2021-08-12T14:21:46.545508Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "20.60",
            "order_id": "ord_0000A9jwHRhpz3THpynwlU",
            "live_mode": false,
            "id": "ore_0000A9mNjnddyN4E9ggQC5",
            "expires_at": "2021-07-29T11:43:48Z",
            "created_at": "2021-07-29T11:23:49.266044Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "129.10",
            "order_id": "ord_0000A9kPI4oFgNlCUU1yUq",
            "live_mode": false,
            "id": "ore_0000A9kPUFIoUoDiVc81oZ",
            "expires_at": "2021-07-28T12:53:37Z",
            "created_at": "2021-07-28T12:33:59.849868Z",
            "confirmed_at": "2021-07-28T12:34:22.224275Z"
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "496.58",
            "order_id": "ord_0000A9gVXInwJnOl2sdqdM",
            "live_mode": false,
            "id": "ore_0000A9iAeLRBd7yLqIalIf",
            "expires_at": "2021-07-27T11:38:19Z",
            "created_at": "2021-07-27T10:38:19.482704Z",
            "confirmed_at": null
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "230.02",
            "order_id": "ord_0000A8bXNBZdLPhqDrOhiy",
            "live_mode": false,
            "id": "ore_0000A9Y8FhqG0FamqhzkjR",
            "expires_at": null,
            "created_at": "2021-07-22T14:24:20.923293Z",
            "confirmed_at": null
        },
        {
            "refund_to": "awaiting_payment",
            "refund_currency": "GBP",
            "refund_amount": "0.00",
            "order_id": "ord_0000A8m0UtmRZiixHbxe5I",
            "live_mode": false,
            "id": "ore_0000A8m0Vs0nAZVDXKhUOn",
            "expires_at": "2021-06-29T10:11:29Z",
            "created_at": "2021-06-29T09:11:29.213765Z",
            "confirmed_at": "2021-06-29T09:11:45.970103Z"
        },
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "447.22",
            "order_id": "ord_0000A8L44l1rVKX8dTqIC0",
            "live_mode": false,
            "id": "ore_0000A8L48YMYXTigViKdZg",
            "expires_at": null,
            "created_at": "2021-06-16T09:14:53.261159Z",
            "confirmed_at": "2021-06-16T09:15:10.448162Z"
        }
    ]
}
