spec/fixtures/order_cancellations/show.json

{
    "data":
        {
            "refund_to": "balance",
            "refund_currency": "GBP",
            "refund_amount": "177.80",
            "order_id": "ord_0000AEMtG5Awt5i1RDfCUa",
            "live_mode": false,
            "id": "ore_0000AEUvjGoJlav2j6FDlZ",
            "expires_at": null,
            "created_at": "2021-12-17T14:40:23.924929Z",
            "confirmed_at": "2021-12-17T14:42:46.367082Z"
        }
    }
